src/Catalogs/Карты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Карты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаУдалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыОктаграм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУстановок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьБиометрию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаУстановкуКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаЦенник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПластиковаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПушУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мессенджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РассылкаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РассылкаСообщений</Name>
			<Comment>Рассылка сообщений</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Comment>Автор документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииОтправкаSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки сообщений</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьНемедленно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеUTF8</Name>
					<Comment>Содержание сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистемаМессенджера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
					<Comment>Получатели сообщений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Comment>Ключ строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Comment>Номер телефон получателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Comment>Получатель сообщения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдКанала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СервисРассылки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
								<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Карты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗаданВопросОБлокировкеАктивныхКарт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере" ФормыЭлемента
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.РасширениеМессенджераПодключено = ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") = Истина;
	
	Если Параметры.Свойство("ВладелецКарты") Тогда
		Объект.ВладелецКарты = Параметры.ВладелецКарты;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаОткрытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() 
		ИЛИ Объект.ТипКода = Перечисления.ВидыКарт.Wallet Тогда
		
		Элементы.КартаТипКода.СписокВыбора.Добавить(Перечисления.ВидыКарт.Wallet);
				
	КонецЕсли;
	
	Если Параметры.Свойство("НовыйВладелецКарты") И ЗначениеЗаполнено(Параметры.НовыйВладелецКарты) Тогда
		
		Объект.ВладелецКарты = Параметры.НовыйВладелецКарты;		
		Объект.Наименование = "";
		
		Если Параметры.Заблокирована Тогда
			Объект.Заблокирована = Ложь
		КонецЕсли;
		
		Если Параметры.пометкаУдаления Тогда
			Объект.ПометкаУдаления = Ложь
		КонецЕсли;
		
	КонецЕсли;
			
	Если Не Объект.Ссылка.Пустая() И Объект.ТипКода = Перечисления.ВидыКарт.Штриховая Тогда
		
		ШтрихКодКарты = Справочники.Карты.ПолучитьДанныеШтрихкода(Объект.Ссылка);
		Если ШтрихКодКарты <> Объект.КодКарты Тогда
			Объект.КодКарты = ШтрихКодКарты;
			ЭтаФорма.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйЭлемент = Ложь;
	
	ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
	
	ИспользоватьКартыWallet = Константы.ИспользоватьWallet.Получить();
	
	Если Объект.ТипКода = Перечисления.ВидыКарт.ПустаяСсылка() Тогда
		
		НовыйЭлемент = Истина;
		
		ИспользуемыйВидКарт = Константы.ИспользуемыйВидКарт.Получить();
		
		Объект.ТипКода = ?(ИспользуемыйВидКарт = Перечисления.ВидыКарт.Wallet И ИспользоватьКартыWallet, ИспользуемыйВидКарт, Перечисления.ВидыКарт.Штриховая);	
		
	КонецЕсли;
		
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
			
//	ЭтотОбъект.ВзаимодействиеМессенджерВнешняяСистема = Документы.РассылкаСообщений.ПолучитьВнешнююСистемуМессенджераДляРассылки(Объект.ВладелецКарты, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Истина);
	ЭтотОбъект.ВзаимодействиеМессенджерВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.GreenApi, Истина);
	
	ЭтотОбъект.КартаУстановлена = Объект.КоличествоУстановок > 0;
	
	Если ЗначениеЗаполнено(Объект.ДатаБлокировки) Тогда				
		
		Элементы.ДатаБлокировки.Видимость  = Истина;	
		Элементы.КартаЗаблокирована.Доступность = Ложь;
		Элементы.ДатаОткрытия.Доступность   = Ложь;
		
	КонецЕсли;

	УстановитьВидимостьДоступность();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, ТекущийОбъект.ПометкаУдаления);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии" ФормыЭлемента
//
Процедура ПриОткрытии(Отказ)
	
	ЕСЛИ Объект.Наименование = "" Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
	СтараяСтрокаНаименования = Объект.Наименование;
	Если СтараяСтрокаНаименования = СформироватьАвтоНаименование() Тогда
		БлокировкаИзмНаименования = ЛОЖЬ;
	Иначе
		БлокировкаИзмНаименования = ИСТИНА;
	КонецЕсли;
	
	ЗаданВопросОБлокировкеАктивныхКарт = Ложь;
	
//	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения" ФормыЭлемента.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			// Преобразуем предварительно к ожидаемому формату.
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных.
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных.
			КонецЕсли;
			
			ПолученыШтрихкоды(Данные, ИмяСобытия);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			
			ДанныеКарты     = МенеджерОборудованияКлиент.ОбработатьДанныеМагнитнойКарты(Параметр);
			Объект.КодКарты = ДанныеКарты.КодШифра;
			Объект.ТипКода  = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "СОХРАНЕНИЕ_ВНЕШНЕЙ_СИСТЕМЫ" Тогда
		
		ВнешняяСистемаWallet = ПолучитьВнешнююСистемуНаСервере();
		
		// ЭлектроннаяКарта = Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet");
		// Элементы.ТипКода.ОтображениеПодсказки = ?(ЭлектроннаяКарта И Не ЗначениеЗаполнено(ВнешняяСистемаWallet), ОтображениеПодсказки.ОтображатьСнизу, ОтображениеПодсказки.Нет);
		Элементы.ДекорацияКартинка.РасширеннаяПодсказка.Заголовок = ПолучитьОписаниеПодсказки(Объект.ТипКода);
		
	КонецЕсли;
	// Конец ВнешнееОборудование 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает внешнюю систему.
//
Функция ПолучитьВнешнююСистемуНаСервере()
	
	Возврат Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
	
КонецФункции

&НаКлиенте
// Обработчик оповещающий форму о выборе
//
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ШаблонКарты = ЗаполнитьШаблонКарты(ВыбранноеЗначение,Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая"));	
	ШаблонКарты.Показать();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Реализация логики Андрея   // Если у карты пустой код, то проверку делать не надо Р. Журавель
	
	Если СокрЛП(Объект.КодКарты) <> "" ИЛИ СокрЛП(Объект.ВнутреннийКодКарты) <> "" Тогда
		
		СтруктураРезультата = ПроверитьНаличиеКодаВСистеме(Объект.Ссылка, Объект.ТипКода, Объект.КодКарты, Объект.ВнутреннийКодКарты);
		Если СтруктураРезультата.ЕстьКодВБазе Тогда
			Отказ = Истина;
			
			ОбъектНазначения = ?(ТипЗнч(СтруктураРезультата.Клиент) = Тип("СправочникСсылка.Контрагенты"), "клиенту", "сотруднику");
			
			Если СтруктураРезультата.Заблокирована = Истина ИЛИ СтруктураРезультата.ПометкаУдаления = Истина Тогда
				ТекстВопроса = СтрШаблон(НСтр("ru = 'Данная карта (%1) назначена другому %2 (%3)
				|Карта заблокирована.
				|Вы хотите разблокировать и назначить ее клиенту (%4)?';
				|en = 'This card (%1) is assigned to another %2 (%3)
				|The card is blocked.
				|You want to unlock and assign it to a client (%4)?'"), 
				СтруктураРезультата.КодКарты, ОбъектНазначения, СтруктураРезультата.ПредставлениеКлиента, Объект.ВладелецКарты);
				
				СтруктураРезультата.Вставить("НовыйВладелец", Объект.ВладелецКарты);
			Иначе
				ТекстВопроса = "Данная карта (" + СтруктураРезультата.КодКарты + ") назначена другому " + ОбъектНазначения + " (" + СтруктураРезультата.ПредставлениеКлиента + "). 
				|Открыть существующую карту?";
				СтруктураРезультата.Вставить("НовыйВладелец", Неопределено);
			КонецЕсли;
			
			ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаВопросаОНаличииКартыВСистеме", ЭтаФорма, СтруктураРезультата);
			ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , НСтр("ru='Сообщение пользователю';en='Message to user'"));
		КонецЕсли;
		
		
		Если НЕ Объект.ПометкаУдаления И НЕ Объект.Заблокирована 
			И ТипЗнч(Объект.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты") И Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная") Тогда
			НезаблокированныеКарты = ПолучитьНезаблокированныеКартыКлиента(Объект.ВладелецКарты, Объект.ТипКода, Объект.Ссылка);
			Если НезаблокированныеКарты > 0 И НЕ ЗаданВопросОБлокировкеАктивныхКарт Тогда
				Отказ = Истина;
				ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), "Активные карты клиента будут заблокированы. Продолжить?",РежимДиалогаВопрос.ДаНет);	
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаданВопросОБлокировкеАктивныхКарт = Истина;
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	Иначе
		ЗаданВопросОБлокировкеАктивныхКарт = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере" ЭлементаФормы
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
			
	Если НЕ Константы.ИспользуемыйВидКарт.Получить() = Объект.ТипКода Тогда
		
		Константы.ИспользуемыйВидКарт.Установить(Объект.ТипКода);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
// Обработчик после записи на клиенте
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СозданаНоваяКарта");
	
	УстановитьВидимостьДоступность();
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриЗакрытии".
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "НачалоВыбораИзСписка" элемента "Наименование"
//
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	БлокировкаИзмНаименования = Ложь;
	СтандартнаяОбработка = Ложь;

	СформироватьАвтоНаименование();
	ВыбранныйЭлемент = Неопределено;

	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("НаименованиеНачалоВыбораИзСпискаЗавершение", ЭтотОбъект), Элементы.Наименование.СписокВыбора, Элемент);
	 
КонецПроцедуры

&НаКлиенте
// Обработчик при изменении наименования
Процедура НаименованиеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	  БлокировкаИзмНаименования= Истина;
КонецПроцедуры

&НаКлиенте
// Обработчик изменения типа кода
Процедура ТипКодаПриИзменении(Элемент)
	
	Если НЕ БлокировкаИзмНаименования Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
// Обработчик при изменении кода карты
Процедура КодКартыПриИзменении(Элемент)
	
	Если НЕ БлокировкаИзмНаименования Тогда
		
		Объект.Наименование = СформироватьАвтоНаименование();
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик кнопки автогенерации штрихкода карты
Процедура СгенерироватьКод(Команда)
	
	Если Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая") Тогда
		Объект.КодКарты = СформироватьШтрихкодEAN13();
	Иначе 
		Объект.КодКарты = СформироватьКодКартыW26(); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Поиск и печать шаблона карты
//
Процедура ПечатьКарты(Команда)
	
	ВыборкаШаблонов = ПолучитьШаблоныПластиковыхКарт();
	
	Если ВыборкаШаблонов.Количество() = 0 Тогда
		
		// запрос на создание новой карты
		ПоказатьВопрос(Новый ОписаниеОповещения("ПечатьКартыОтвет", ЭтаФорма)
				, НСтр("ru='Создать шаблон карты?';en='Create template cards?'")
				, РежимДиалогаВопрос.ДаНет,,
				,НСтр("ru='Не обнаружено ни одного шаблона карты!';en='Not discovered any one pattern cards!'"));
		
	ИначеЕсли ВыборкаШаблонов.Количество() = 1 Тогда
		
		ШаблонКарты = ЗаполнитьШаблонКарты(ВыборкаШаблонов[0],Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая"));	
		ШаблонКарты.Показать();	
		
	Иначе
		
		// форма выбора макета
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ТипШаблона",ПредопределенноеЗначение("Перечисление.ТипыШаблонов.ПластиковаяКарта")));
		ОткрытьФорму("Справочник.ХранилищеШаблонов.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
// Открыть список шаблонов карт
Процедура НастройкаШаблонаПечатнойКарты(Команда)
	
	ОткрытьФорму("Справочник.ХранилищеШаблонов.ФормаСписка");
		
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьДополнительно(Команда)
	Элементы.ГруппаДополнительно.Видимость =  НЕ Элементы.ГруппаДополнительно.Видимость;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура установки видимости элементов формы
//
Процедура УстановитьВидимостьДоступность()
		
	ЭлектроннаяКарта = Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet");
	
	Элементы.КартаКодКарты.ТолькоПросмотр      = ЭлектроннаяКарта;
	Элементы.КартаВнутреннийКодКарты.Видимость = НЕ ЭлектроннаяКарта;
	Элементы.КартаТипКода.ТолькоПросмотр 	   = ЭлектроннаяКарта;
	Элементы.КартаВидКарты.ТолькоПросмотр      = ЭлектроннаяКарта;
	
	Элементы.КартаСсылкаНаУстановку.Видимость  = ЭлектроннаяКарта;
	
	Элементы.ПризнакУстановки.Видимость = ЭлектроннаяКарта;
	
	Элементы.ОтправитьСсылку.Видимость  = ЭлектроннаяКарта;
	
	Элементы.КнопкаПечать.Видимость = НЕ ЭлектроннаяКарта;
	Элементы.ШаблонКарты.Видимость  = НЕ ЭлектроннаяКарта;
		
	Элементы.ГруппаУдаленияКарты.Видимость = Объект.КартаУдалена И ЭлектроннаяКарта И ЗначениеЗаполнено(ВнешняяСистемаWallet); 
	
	Элементы.ДекорацияКартинка.Подсказка = ПолучитьПодсказкуПоВидуКарты(Объект.ТипКода);
	Элементы.ДекорацияКартинка.Картинка  = ПолучитьПиктограммуПоВидуКарты(Объект.ТипКода);
	
	// Элементы.ВладелецКарты.ТолькоПросмотр = ЭлектроннаяКарта;
		
	Элементы.КартаВидКарты.СписокВыбора.Очистить();
	Элементы.КартаВидКарты.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДоступныхВидовКарт(ЭлектроннаяКарта));
	
	Элементы.ДекорацияКартинка.РасширеннаяПодсказка.Заголовок = ПолучитьОписаниеПодсказки(Объект.ТипКода);
	
	Элементы.ГруппаУдалитьКарта.Видимость = ЭлектроннаяКарта;
		
КонецПроцедуры

&НаСервере
// Функция, получает подсказку по виду карты.
//
Функция ПолучитьПодсказкуПоВидуКарты(ВидКарты)
	
	Если ВидКарты = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet") Тогда
		Возврат "Электронная";
	ИначеЕсли ВидКарты = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая") Тогда
		Возврат "Штриховая";
	Иначе
		Возврат "Магнитная";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, возвращает массив доступных видов карт.
//
Функция ПолучитьМассивДоступныхВидовКарт(ЭлектроннаяКарта)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКарт КАК ВидыКарт
	|ГДЕ
	|	НЕ ВидыКарт.ПометкаУдаления
	|	И &УсловиеВидКарты");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеВидКарты", ?(ЭлектроннаяКарта, "И ВидыКарт.ИдентификаторПроекта <> 0", "И ВидыКарт.ИдентификаторПроекта = 0"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	       	
КонецФункции

&НаСервере
// Функция, получает пиктограмму по виду карты.
//
Функция ПолучитьПиктограммуПоВидуКарты(ВидКарты)
	
	Если ВидКарты = Перечисления.ВидыКарт.Wallet Тогда
		Возврат БиблиотекаКартинок.КартаWallet;
	ИначеЕсли ВидКарты = Перечисления.ВидыКарт.Штриховая Тогда
		Возврат БиблиотекаКартинок.КартаШтриховая;
	Иначе
		Возврат БиблиотекаКартинок.КартаМагнитная;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСпискаЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Наименование = ВыбранныйЭлемент.Значение;
	КонецЕсли;

КонецПроцедуры
    
&НаСервереБезКонтекста
// Сформировать штрихкод формата EAN13
//
Функция СформироватьШтрихкодEAN13()
	
	Возврат РегистрыСведений.Штрихкоды.СформироватьШтрихкодEAN13();
	
КонецФункции // СформироватьШтрихкодEAN13()

&НаСервереБезКонтекста
// Функция, сформировать код w26.
//
Функция СформироватьКодКартыW26()
	
	Возврат Справочники.Карты.ПолучитьКодКартыW26();
	
КонецФункции

&НаСервере
Функция ПолучитьШаблоныПластиковыхКарт()
	
	Возврат Справочники.ХранилищеШаблонов.ПолучитьШаблоныПластиковыхКарт();
	
КонецФункции

&НаСервере
// Заполнить шаблон карты для печати
//
Функция ЗаполнитьШаблонКарты(ХранилищеШаблоновСсылка, ГенерироватьКартинкуШтрихкода)

	ШаблонКарты = ХранилищеШаблоновСсылка.Шаблон.Получить();
	
	ТабДок = Новый ТабличныйДокумент;	
	Если ШаблонКарты <> Неопределено Тогда
		ШаблонКарты.Свойство("РедакторТабличныйДокумент", ТабДок);	
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыИмя"     	     , Объект.ВладелецКарты.Имя));
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыФамилия" 	     , Объект.ВладелецКарты.Фамилия));
    МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыОтчество"	     , Объект.ВладелецКарты.Отчество));
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыНаименование"   , Объект.ВладелецКарты.Наименование));
	Если ТипЗнч(Объект.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты") Тогда
		МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыДатаРегистрации", Формат(Объект.ВладелецКарты.ДатаРегистрации, "ДЛФ=Д")));	
	КонецЕсли;
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","КодКарты"                    , Объект.КодКарты));
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВидКарты"                    , Строка(Объект.ВидКарты)));	
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ТипКода"                     , Строка(Объект.ТипКода)));
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ДатаОткрытия"                , Формат(Объект.ДатаОткрытия, "ДЛФ=Д")));

	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВнутреннийКодКарты"          , Объект.ВнутреннийКодКарты));
	
	//// Если у владеца есть пиктограмма фотографии
	// Если Новый_Массив(Тип("СправочникСсылка.Контрагенты"), Тип("СправочникСсылка.Сотрудники")).Найти(ТипЗнч(Объект.ВладелецКарты)) <> Неопределено И ЗначениеЗаполнено(Объект.ВладелецКарты.ФайлКартинки) Тогда
	//	
	//	ФотоКлиента = ПолучитьНавигационнуюСсылкуКартинки(Объект.ВладелецКарты.ФайлКартинки,УникальныйИдентификатор);	
	//	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(Объект.ВладелецКарты.ФайлКартинки);
	//	Если ДанныеФайла.ДвоичныеДанные <> Неопределено Тогда
	//		ФотоКлиента = Новый Картинка(ДанныеФайла.ДвоичныеДанные);
	//		МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыФайлКартинки",ФотоКлиента));
	//	КонецЕсли;
	//	
	// КонецЕсли;
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	// Получаем картинку штрихкода карты
	Если ГенерироватьКартинкуШтрихкода Тогда
		Если ШаблонКарты <> Неопределено Тогда
			Область = ТабДок.ПолучитьОбласть(ШаблонКарты.ИмяОбластиПечати);
			
			Для каждого Рисунок Из Область.Рисунки Цикл
				Если Лев(Рисунок.Имя,8) = "ШтрихКод" Тогда
					
					// ЗначениеШтрихкода = СтрокаТовары[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ПолучитьИмяПараметраШтрихкод())];
					// Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
					
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
					ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
					ПараметрыШтрихкода.Вставить("ТипКода",         ШаблонКарты.ТипКода);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", ШаблонКарты.ОтображатьТекст);
					ПараметрыШтрихкода.Вставить("РазмерШрифта",    ШаблонКарты.РазмерШрифта);								
					ПараметрыШтрихкода.Вставить("Штрихкод",        Объект.КодКарты);
					
					Картинка          = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
					// Новый Структура("Ширина,Высота,ТипКода,ОтображатьТекст,РазмерШрифта,Штрихкод",400,40,3,Истина,8,Объект.КодКарты));	
					
					МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра", "ШтрихКод", Картинка));
					
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;	
	
	Справочники.ХранилищеШаблонов.ЗаполнитьШаблоныВТабличномДокументе(ТабДок,МассивПараметров);
	
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_Печать_Карты";
	
	Возврат ТабДок;
	
КонецФункции

&НаСервереБезКонтекста
// Функция возвращает навигационную ссылку картинки
//
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)

	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ФайлКартинки) = Тип("СправочникСсылка.КонтрагентыПрисоединенныеФайлы") Тогда
		ФайлДляПоиска = ФайлКартинки;
	Иначе
		ФайлДляПоиска = ФайлКартинки.ТекущаяВерсия;
	КонецЕсли;	
	
	Возврат РаботаСФайламиСлужебный.ПолучитьНавигационнуюСсылкуВоВременномХранилище(ФайлДляПоиска);

КонецФункции
	
&НаКлиенте
// Функция формирует наименование карты клиента
//
Функция СформироватьАвтоНаименование()
	  
	Элементы.Наименование.СписокВыбора.Очистить();
			
	СтрокаНаименования = ""+Объект.КодКарты +", " +Объект.ВладелецКарты + " (" + Объект.ТипКода + ")";
			
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
			
	Возврат СтрокаНаименования;
КонецФункции // СформироватьАвтоНаименование()
  
&НаСервере
// Получить штрихкод 
//
Функция ПолученыШтрихкоды(ДанныеШтрикодов, ИмяСобытия)
	
	Модифицированность = Истина;
	
	Если ДанныеШтрикодов.Количество() > 0 Тогда
		Объект.ТипКода = Перечисления.ВидыКарт.Штриховая;
		Объект.КодКарты = ДанныеШтрикодов[ДанныеШтрикодов.Количество() - 1].Штрихкод;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПолученыШтрихкоды()

&НаСервереБезКонтекста
// Функция - Проверить наличие кода
//
// Параметры:
//  Ссылка	 - 	 - 
//  ТипКода	 - 	 - 
//  КодКарты - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьНаличиеКодаВСистеме(Ссылка, ТипКода, КодКарты, ВнутрКодКарты)
	
	Возврат Справочники.Карты.ПроверитьНаличиеКодаВСистеме(Ссылка, ТипКода, КодКарты, ВнутрКодКарты);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить незаблокированные карты клиента по типу кода
//
Функция ПолучитьНезаблокированныеКартыКлиента(Клиент, ТипКода, ИсключитьКарту)
	
	Возврат Справочники.Карты.ПолучитьКартыКлиента(Клиент, ,ТипКода,, Ложь, ИсключитьКарту).Количество();
	
КонецФункции

&НаСервереБезКонтекста
// Заполнить шаблон карты для печати
//
Функция ЗаполнитьШаблонКартыIDПропуск(ХранилищеШаблоновСсылка, Карта)

	ШаблонКарты = ХранилищеШаблоновСсылка.Шаблон.Получить();
	
	ТабДок = Новый ТабличныйДокумент;	
	Если ШаблонКарты <> Неопределено Тогда
		ШаблонКарты.Свойство("РедакторТабличныйДокумент", ТабДок);	
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыНаименование", Карта.ВладелецКарты.Наименование));
    МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыИмя"         , Карта.ВладелецКарты.Имя));
    МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыОтчество"    , Карта.ВладелецКарты.Отчество));
    МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра","ВладелецКартыФамилия"     , Карта.ВладелецКарты.Фамилия));
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	// Получаем картинку штрихкода карты
	Если ШаблонКарты <> Неопределено Тогда
		Область = ТабДок.ПолучитьОбласть(ШаблонКарты.ИмяОбластиПечати);
		
		Для каждого Рисунок Из Область.Рисунки Цикл
			Если Лев(Рисунок.Имя,8) = "ШтрихКод" Тогда
					
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("ТипКода",         ШаблонКарты.ТипКода);
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", ШаблонКарты.ОтображатьТекст);
				ПараметрыШтрихкода.Вставить("РазмерШрифта",    ШаблонКарты.РазмерШрифта);								
				ПараметрыШтрихкода.Вставить("Штрихкод",        Карта.КодКарты);
				
				Картинка = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);	
				МассивПараметров.Добавить(Новый Структура("ИмяПараметра,ЗначениеПараметра", "ШтрихКод", Картинка));
				
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Справочники.ХранилищеШаблонов.ЗаполнитьШаблоныВТабличномДокументе(ТабДок, МассивПараметров);
	
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_Печать_Карты";
	
	Возврат ТабДок;
	
КонецФункции

#Область ОбработчикиОповещенийАсинхронныхСобытий

// Процедура - Печать карты ответ
// Завершение немодального открытия окна "ПоказатьВопрос()"
// Параметры:
//  РезультатВопроса - Ответ на вопрос
//  Параметры	     - Параметры Оповещения
//
&НаКлиенте
Процедура ПечатьКартыОтвет(РезультатВопроса, Параметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Справочник.ХранилищеШаблонов.ФормаОбъекта");	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработка результата вопроса о наличии карты в системе
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбработкаРезультатаВопросаОНаличииКартыВСистеме(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		ОткрытьФорму("Справочник.Карты.Форма.ФормаЭлемента", Новый Структура("Ключ, НовыйВладелецКарты, Заблокирована, ПометкаУдаления", 
			ДополнительныеПараметры.КартаКлиента, ДополнительныеПараметры.НовыйВладелец, ДополнительныеПараметры.Заблокирована, ДополнительныеПараметры.ПометкаУдаления));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "АвтоПодбор".
//
Процедура ВидКартыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Элемент.ПараметрыВыбора = ПолучитьПараметрыВыбораВидыКарт(Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet"));
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает параметры выбора видов карт.
//
Функция ПолучитьПараметрыВыбораВидыКарт(ЭлектроннаяКарта)
	
	Возврат Справочники.Карты.ПолучитьПараметрыВыбораВидыКарт(ЭлектроннаяКарта);	
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ОтправитьСсылкуНаУстановкуКарты(Команда)
	
	Если Не ЗначениеЗаполнено(СервисыРассылки) Тогда
		ЗаполнитьСервисыРассылки();	
	КонецЕсли;
	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПослеВыбораСервисаРассылкиЗавершение", ЭтотОбъект, Новый Структура("Карта", Объект.Ссылка)), СервисыРассылки, ТекущийЭлемент);
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет сервисы рассылки для отправки ссылки на установку карты.
//
Процедура ЗаполнитьСервисыРассылки()
	
	//// Мессенджер.
	//
	// НомерТелефона = ПолучитьКонтактныеДанныеКонтрагента("Телефон");
	// Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеМессенджерВнешняяСистема) И ЗначениеЗаполнено(НомерТелефона) Тогда
	//			
	//	СервисыРассылки.Добавить("Мессенджер", "Мессенджер",, БиблиотекаКартинок.Whatsapp16);
	//	
	// КонецЕсли;
	//
	//// СМС.
	//	
	// РассылкаНаТелефонРазрешена = ПроверитьВозможностьИспользованияSMSРассылки() И ЗначениеЗаполнено(НомерТелефона);
	//		
	// Если РассылкаНаТелефонРазрешена Тогда
	//	СервисыРассылки.Добавить("SMS", "SMS",, БиблиотекаКартинок.SMS32);
	// КонецЕсли;
	//
	//// Электронная почта.
	//
	// АдресЭП = ПолучитьКонтактныеДанныеКонтрагента("АдресЭлектроннойПочты");	
	// РассылкаНаПочтуРазрешена = ПроверитьВозможностьИспользованияEmailРассылки() И ЗначениеЗаполнено(АдресЭП);	
	// Если РассылкаНаПочтуРазрешена Тогда
	//	СервисыРассылки.Добавить("Письмо", "Письмо",, БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);	
	// КонецЕсли;
	
	СервисыРассылки.Добавить("Мессенджер", "Мессенджер",, БиблиотекаКартинок.ОтправкаСообщения);
	СервисыРассылки.Добавить("SMS", "SMS",, БиблиотекаКартинок.ОтправитьSMS);
	СервисыРассылки.Добавить("Письмо", "Письмо",, БиблиотекаКартинок.ОтправитьEmail);
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет отправку ссылки на установку карты.
//
Процедура ОтправитьСсылкуНаУстановкуКартыНаСервере(Получатель, Карта, СервисРассылки, ОписаниеОшибки)
			
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Содержание = ПреобразоватьСодержаниеСПараметрамиВТекст(Карта, Ложь);
	
	ПараметрыРассылки = Новый Структура;

	ПараметрыРассылки.Вставить("Получатели", Новый_Массив(Новый Структура("Получатель, Карта", Получатель, Карта)));
	
	Если СервисРассылки = "SMS" Тогда
		ПараметрыРассылки.Вставить("ОтправкаSMS", Истина);
		
	ИначеЕсли СервисРассылки = "Мессенджер" Тогда
		ПараметрыРассылки.Вставить("ОтправкаMessenger"	 , Истина);
		ПараметрыРассылки.Вставить("ИнициироватьОтправку", Истина);
		
	КонецЕсли;
	
	ПараметрыРассылки.Вставить("ОтправитьНемедленно", Истина);
	ПараметрыРассылки.Вставить("Содержание"         , Содержание);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница" , ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецПроцедуры

// Функция, проверяет возможность использования eamil рассылки.
// 
Функция ПроверитьВозможностьИспользованияEmailРассылки()
	
	УчетныеЗаписиСуществуют = Справочники.УчетныеЗаписиЭлектроннойПочты.СуществуютУчетныеЗаписиЭлектроннойПочтыОбщиеИЛичные(ПараметрыСеанса.ТекущийПользователь, Ложь, Истина, Истина);
		
	Если НЕ УчетныеЗаписиСуществуют Тогда
		ОписаниеОшибки = "Для пользователя не задана учетная запись электронной почты";
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Функция, проверяет возможность использования sms рассылки.
// 
Функция ПроверитьВозможностьИспользованияSMSРассылки()
	
	СервисSMSРассылки = Константы.СервисSMSРассылкиПоУмолчанию.Получить();
	Если ЗначениеЗаполнено(СервисSMSРассылки) Тогда 
		Результат = Справочники.СервисыРассылки.ПолучитьБалансАккаунтаSMS(СервисSMSРассылки);
		Если Не Результат.Ошибка И Результат.Баланс > 0 Тогда
			Возврат Истина;
		Иначе
			ОписаниеОшибки = СервисSMSРассылки.Наименование + ". " + Результат.ОписаниеОшибки;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ОписаниеОшибки = НСтр("Не выбран сервис рассылки по умолчанию");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура, возвращает номера телефонов контрагентов.
// 
Функция ПолучитьКонтактныеДанныеКонтрагента(ТипКонтактнойИнформации)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	&ВыбираемоеПоле КАК Контакт
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И НЕ КонтактнаяИнформация.НеУчаствоватьВРассылке
	|	И НЕ КонтактнаяИнформация.Ссылка.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Контрагент"				, Объект.ВладелецКарты);
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации" , Перечисления.ТипыКонтактнойИнформации[ТипКонтактнойИнформации]);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыбираемоеПоле", ?(ТипКонтактнойИнформации = "Телефон", "КонтактнаяИнформация.НомерТелефона", "КонтактнаяИнформация.Представление"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Контакт, Неопределено);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик оповещения "ПослеВыбораСервисаРассылкиЗавершение".
//
Процедура ПослеВыбораСервисаРассылкиЗавершение(Результат, Контекст) Экспорт
	
	Если Результат <> Неопределено Тогда	
		
		Содержание = ПреобразоватьСодержаниеСПараметрамиВТекст(Контекст.Карта, (НЕ Результат.Значение = "Письмо"));		
		МассивПолучателей = Новый Массив;
		МассивПолучателей.Добавить(Объект.ВладелецКарты);
		
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", Новый Структура("МассивПолучателей", МассивПолучателей));
		
		Если Результат.Значение = "Письмо" Тогда
			
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Тело"	 , Содержание);
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Тема"	 , "Создание карты");
			ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыОткрытия);
			
		Иначе
			
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ОтправкаMessenger"	 , (Результат.Значение = "Мессенджер"));
			ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("Содержание", Содержание);
			ОткрытьФорму("Документ.РассылкаСообщений.Форма.ФормаДокумента", ПараметрыОткрытия);
			
		КонецЕсли;
				
		// Если НЕ Результат.Значение = "Письмо" Тогда
		//	
		//	ОписаниеОшибки = "";
		//	ОтправитьСсылкуНаУстановкуКартыНаСервере(Объект.ВладелецКарты, Контекст.Карта, Результат.Значение, ОписаниеОшибки);
		//	
		//	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		//	КонецЕсли;
		//	
		// Иначе			
		//	СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Объект.ВладелецКарты, АдресЭП, Контекст.Карта);			
		// КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Преобразовать содержание с параметрами в текст
// 
&НаСервереБезКонтекста
Функция ПреобразоватьСодержаниеСПараметрамиВТекст(Карта, ОтправитьSMS = Истина)
	
	Если ЗначениеЗаполнено(Карта.ВидКарты.ШаблонСообщения) Тогда
		Содержание = ?(ОтправитьSMS, Карта.ВидКарты.ШаблонСообщения.Содержание, Карта.ВидКарты.ШаблонСообщения.ТекстHTML);
	Иначе	
		Содержание = ?(ОтправитьSMS, Справочники.ШаблоныСообщений.СозданиеКарты.Содержание, Справочники.ШаблоныСообщений.СозданиеКарты.ТекстHTML);
	КонецЕсли;

	Возврат Справочники.ШаблоныСообщений.ПреобразоватьСодержаниеСПараметрамиВТекст(Содержание,,,,, Карта); 
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Создать документ исходящее письмо отправить письмо на сервере.
// 
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  Тема						 - 	 -
//  ОписаниеОшибки				 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Контакт, Адрес, Карта)
	
	Тема = "Ссылка на установку карты";
	Содержание = ПреобразоватьСодержаниеСПараметрамиВТекст(Карта, Ложь);
		
	МассивПолучателей = Новый массив;
	МассивПолучателей.Добавить(Контакт);
	
	МассивEmail = Новый Массив;
	МассивEmail.Добавить(Адрес);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"             , ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Тема"             , Тема);
	ДанныеЗаполнения.Вставить("Тело"             , Содержание);
	ДанныеЗаполнения.Вставить("ТекстHTML"		 , Содержание);
	ДанныеЗаполнения.Вставить("МассивПолучателей", МассивПолучателей);
	ДанныеЗаполнения.Вставить("МассивEmail"		 , МассивEmail);
	ДанныеЗаполнения.Вставить("Тип"              , Перечисления.ТипыСобытий.Письмо); 
	ДанныеЗаполнения.Вставить("АвторДокумента"	 , ПараметрыСеанса.ТекущийПользователь);
	ДанныеЗаполнения.Вставить("Ответственный" 	 , ПараметрыСеанса.ТекущийПользователь);
	ДанныеЗаполнения.Вставить("ТипТекста"		 , Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Заполнить(ДанныеЗаполнения);
	
	ОписаниеОшибки = "";
	Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки);
	
КонецФункции 

&НаКлиенте
// Процедура, обработчик события "ТипКодаРасширеннаяПодсказкаОбработкаНавигационнойСсылки".
//
Процедура ТипКодаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВСWallet = ПолучитьВнешнююСистемуWallet();
	
	Если ЗначениеЗаполнено(ВСWallet) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ВСWallet);
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Wallet")));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВнешниеСистемы.ФормаОбъекта", ПараметрыФормы,,,,,, ?(ЗначениеЗаполнено(ВСWallet), РежимОткрытияОкнаФормы.Независимый, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс));
	
КонецПроцедуры

// Функция, возвращает внешнюю систему.
//
Функция ПолучитьВнешнююСистемуWallet()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	0 КАК Приоритет
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet)
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.Используется
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВнешниеСистемы.Ссылка,
	|	1
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.Wallet)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

&НаСервере
// Процедура, обработчик команды "УдалитьКартуНаСервере".
//
Функция УдалитьКартуНаСервере()
	
	РезультатОбновления = Справочники.Карты.ОбновитьКартуWallet(Объект.Ссылка, ВнешняяСистемаWallet,, Истина);
	
	РезультатУдаления = Новый Структура("Успешно, ОписаниеОшибки", Ложь, РезультатОбновления.ОписаниеОшибки);
	Если РезультатОбновления.Успешно Тогда 
		
		РезультатУдаления = Справочники.Карты.УдалитьКартуWallet(Объект.Ссылка, ВнешняяСистемаWallet);
		
		Объект.КартаУдалена = Истина;
		Объект.ПометкаУдаления = Истина;
	КонецЕсли; 
	
	Возврат РезультатУдаления; 
	
КонецФункции

&НаСервере
// Функция, возвращает описание подсказки.
//
Функция ПолучитьОписаниеПодсказки(ТипКарты)
	
	ЭлектроннаяКарта = ТипКарты = Перечисления.ВидыКарт.Wallet;
	
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(?(ЭлектроннаяКарта, "Электронная", Строка(ТипКарты)) + Символы.ПС);
	
	Если ЭлектроннаяКарта Тогда
		
		ВСНастроена = ЗначениеЗаполнено(ВнешняяСистемаWallet.ТокенДоступа) И ЗначениеЗаполнено(ВнешняяСистемаWallet.КлючШифрования);
		
		МассивСтрок.Добавить(?(ВСНастроена, "  ", ""));
		
		ДопОписание = Новый ФорматированнаяСтрока(?(ВСНастроена, "Настроить", "Подключить"),, ?(ВСНастроена, Новый Цвет(28, 85, 174), Новый Цвет(255, 0, 0)),, "Ссылка"); 
		
		МассивСтрок.Добавить(ДопОписание);
		
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецФункции

&НаКлиенте
// Процедура, обработчик команды "УдалитьКарту".
//
Процедура УдалитьКарту(Команда)
	
	Если Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet") И ЗначениеЗаполнено(ВнешняяСистемаWallet) Тогда 
		
		ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаУдаленияКарты", ЭтаФорма);
		
		ТекстВопроса = "Электронная карта будет безвозвратно удалена. Продолжить?";
		
		ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , НСтр("ru='Внимание!';en='Attention!'"));
		
	Иначе
		
		ПометитьНаУдалениеНаСервере();
		
		Оповестить("ИзмененаКарта");
		
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
// Процедура, обработчик команды "УдалитьКартуНаСервере".
//
Процедура ПометитьНаУдалениеНаСервере()
	
	КартаОбъект = Объект.Ссылка.ПолучитьОбъект();
	КартаОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После вопроса удаления карты
//
Процедура ПослеВопросаУдаленияКарты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		РезультатУдаления = УдалитьКартуНаСервере();
	    Если РезультатУдаления.Успешно Тогда
			Оповестить("ИзмененаКарта");
			ЭтаФорма.Записать();
			ЭтаФорма.Модифицированность = Ложь;
			ЭтаФорма.Закрыть();
		ИначеЕсли ЗначениеЗаполнено(РезультатУдаления.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатУдаления.ОписаниеОшибки);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияКартинкаРасширеннаяПодсказкаОбработкаНавигационнойСсылки".
//
Процедура ДекорацияКартинкаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВСWallet = ПолучитьВнешнююСистемуWallet();
	
	Если ЗначениеЗаполнено(ВСWallet) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ВСWallet);
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ТипВнешнейСистемы", ПредопределенноеЗначение("Перечисление.ТипыВнешнихСистем.Wallet")));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВнешниеСистемы.ФормаОбъекта", ПараметрыФормы,,,,,, ?(ЗначениеЗаполнено(ВСWallet), РежимОткрытияОкнаФормы.Независимый, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс));	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
